---
kind: other
id: Methods.T:Autodesk.Revit.DB.BeamSystem
source: html/e84d68b9-b128-c2fd-a8e9-d9afdf3a613a.htm
---
# BeamSystem Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.